app/controllers/posts_controller.rb

  def index
    if params[:author_id]
      @author = Author.find_by_id(params[:author_id])
      if @author.present?
        @posts = Author.find(params[:author_id]).posts
      else
        redirect_to authors_path, alert: "Author not found."
      end
    else
      @posts = Post.all
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "posts".* FROM "posts"

  def show
    if params[:author_id]
      @author = Author.find_by_id(params[:author_id])
      if @author.present?
        @post = Author.find(params[:author_id]).posts.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]

  def edit
    if params[:author_id]
      @author = Author.find_by_id(params[:author_id])
      if @author.present?
        @post = @author.posts.find_by_id(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 123456]]
SELECT "authors".* FROM "authors"
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]